driver-tests/bpelse/assign/AssignJbi/test/echoHexBinaryDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoHexBinaryDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoHexBinaryDataType">
    <string>6765726F</string>
    <normalizedString>6765726F</normalizedString>
    <token>6765726F</token>
    <base64Binary>6765726F</base64Binary>
    <hexBinary>6765726F</hexBinary>
    <integer>6765726F</integer>
    <positiveInteger>6765726F</positiveInteger>
    <negativeInteger>6765726F</negativeInteger>
    <nonNegativeInteger>6765726F</nonNegativeInteger>
    <nonPositiveInteger>6765726F</nonPositiveInteger>
    <long>6765726F</long>
    <unsignedLong>6765726F</unsignedLong>
    <int>6765726F</int>
    <unsignedInt>6765726F</unsignedInt>
    <short>6765726F</short>
    <unsignedShort>6765726F</unsignedShort>
    <byte>6765726F</byte>
    <unsignedByte>6765726F</unsignedByte>
    <decimal>6765726F</decimal>
    <float>6765726F</float>
    <double>6765726F</double>
    <boolean>6765726F</boolean>
    <duration>6765726F</duration>
    <dateTime>6765726F</dateTime>
    <date>6765726F</date>
    <time>6765726F</time>
    <gYear>6765726F</gYear>
    <gYearMonth>6765726F</gYearMonth>
    <gMonth>6765726F</gMonth>
    <gMonthDay>6765726F</gMonthDay>
    <gDay>6765726F</gDay>
    <Name>6765726F</Name>
    <QName>6765726F</QName>
    <NCName>6765726F</NCName>
    <anyURI>6765726F</anyURI>
    <language>6765726F</language>
    <ID>6765726F</ID>
    <IDREF>6765726F</IDREF>
    <IDREFS>6765726F</IDREFS>
    <ENTITY>6765726F</ENTITY>
    <ENTITIES>6765726F</ENTITIES>
    <NMTOKEN>6765726F</NMTOKEN>
    <NMTOKENS>6765726F</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
